
&НаКлиенте
Процедура Задание3(Команда)

	
//	Функция для проверки баланса скобок, то есть количество открытых
// скобок должно совпадать с количеством закрытых, причём
// необходимо отличать тип скобочек — круглые, квадратные,
// фигурные. Функция возвращает значение типа int, если 0 —
// баланс скобок нарушен, если 1 — баланс скобок выдержан, если -1
// скобок во входной строке нет.     
Если (СтрЧислоВхождений(Строка,"("))	> 0 или 0 < СтрЧислоВхождений(Строка,")")тогда 
Если (СтрЧислоВхождений(Строка,"("))	> СтрЧислоВхождений(Строка,")") или (СтрЧислоВхождений(Строка,"(")) < СтрЧислоВхождений(Строка,")") Тогда
Итог = 0;
	
иначе 	
	Если (СтрЧислоВхождений(Строка,"("))	= СтрЧислоВхождений(Строка,")") и (СтрЧислоВхождений(Строка,"(")) > 0	 тогда
		Итог = 1;
	иначе
		Итог =-1;
			КонецЕсли;
		КонецЕсли;
КонецЕсли;		




Если (СтрЧислоВхождений(Строка,"{"))	> 0 или 0 < СтрЧислоВхождений(Строка,"}") тогда
		Если (СтрЧислоВхождений(Строка,"{"))	> СтрЧислоВхождений(Строка,"}") или (СтрЧислоВхождений(Строка,"{")) < СтрЧислоВхождений(Строка,"}") Тогда
Итог = 0;
	
иначе 	
	Если (СтрЧислоВхождений(Строка,"{"))	= СтрЧислоВхождений(Строка,"}") и (СтрЧислоВхождений(Строка,"{")) > 0	 тогда
		Итог = 1;
	иначе
		Итог =-1;
			КонецЕсли;
		КонецЕсли; 
		
		
КонецЕсли;		
Если (СтрЧислоВхождений(Строка,"["))	> 0 или 0 < СтрЧислоВхождений(Строка,"]")	тогда	
		Если (СтрЧислоВхождений(Строка,"["))	> СтрЧислоВхождений(Строка,"]") или (СтрЧислоВхождений(Строка,"[")) < СтрЧислоВхождений(Строка,"]") Тогда
Итог = 0;
	
иначе 	
	Если (СтрЧислоВхождений(Строка,"["))	= СтрЧислоВхождений(Строка,"]") и (СтрЧислоВхождений(Строка,"[")) > 0	 тогда
		Итог = 1;
	иначе
		Итог =-1;
			КонецЕсли;
КонецЕсли;
  КонецЕсли;

  Если  СтрЧислоВхождений(Строка,"(")	= 0 и 0 = СтрЧислоВхождений(Строка,")") и СтрЧислоВхождений(Строка,"{")	= 0 и 0 = СтрЧислоВхождений(Строка,"}") и СтрЧислоВхождений(Строка,"[")	= 0 и 0 = СтрЧислоВхождений(Строка,"]") тогда
Итог =-1;
			КонецЕсли;
	  







КонецПроцедуры

&НаКлиенте
Процедура Задание1(Команда)

			 Итог = (СтрДлина(Строка));
КонецПроцедуры

&НаКлиенте
Процедура Задание2(Команда)
	ИсходнаяСтрока=Строка;

НомерПоследнийСимвол=СтрДлина(ИсходнаяСтрока);
СтрокаПослеСортировки="";
пока НомерПоследнийСимвол > 0 Цикл 
СтрокаПослеСортировки = СтрокаПослеСортировки + Сред(ИсходнаяСтрока,НомерПоследнийСимвол,1);
НомерПоследнийСимвол = НомерПоследнийСимвол-1;
ОбработкаПрерыванияПользователя();
КонецЦикла;
Итог = (СтрокаПослеСортировки);КонецПроцедуры
